aaron-bond.better-comments
akamud.vscode-theme-onelight
bjubineau.c-cpp-preprocessors-visualizer
chadalen.vscode-jetbrains-icon-theme
chneau.saturated-dark-modern
chneau.saturated-dark-plus
cooble.espulp
emmanuelbeziat.vscode-great-icons
espressif.esp-idf-extension
finnc.endif-comments
formulahendry.code-runner
github.copilot
github.copilot-chat
gruntfuggly.todo-tree
haoyan-li.esp32-debug
ibm.output-colorizer
igorsbitnev.error-gutters
jeff-hykin.better-c-syntax
jeff-hykin.better-cpp-syntax
jeff-hykin.better-shellscript-syntax
kamikillerto.vscode-colorize
kash4kev.vscode-esp8266fs
ldprg.saturated-dark-modern-oled
leodevbro.blockman
loilo.snazzy-light
mechatroner.rainbow-csv
ms-python.autopep8
ms-python.black-formatter
ms-python.debugpy
ms-python.flake8
ms-python.mypy-type-checker
ms-python.python
ms-python.vscode-pylance
ms-python.vscode-python-envs
ms-vscode-remote.remote-containers
ms-vscode-remote.remote-ssh
ms-vscode-remote.remote-ssh-edit
ms-vscode-remote.remote-wsl
ms-vscode-remote.vscode-remote-extensionpack
ms-vscode.cpptools
ms-vscode.cpptools-themes
ms-vscode.hexeditor
ms-vscode.remote-explorer
ms-vscode.remote-server
ms-vscode.vscode-embedded-tools
ms-vscode.vscode-serial-monitor
naumovs.color-highlight
oderwat.indent-rainbow
pioarduino.pioarduino-ide
platformio.platformio-ide
redhat.vscode-xml
redhat.vscode-yaml
shardulm94.trailing-spaces
shd101wyy.markdown-preview-enhanced
streetsidesoftware.code-spell-checker
streetsidesoftware.code-spell-checker-romanian
supermarketcartographer.saturday-light
thelastoutpostworkshop.arduino-maker-workshop
trond-snekvik.gnu-mapfiles
twxs.cmake
uloco.theme-bluloco-light
usernamehw.errorlens
virtualplay.vibrant-semantics-dark
visualstudioexptteam.vscodeintellicode-completions
vscode-arduino.vscode-arduino-community
vscode-icons-team.vscode-icons
yasht.terminal-all-in-one
